.emacs.d/init.el
(setq user-emacs-directory (expand-file-name "~/.emacs.d"))
(setq debug-on-error t)
(setq evil-want-integration t)
(setq evil-want-keybinding nil)

;; Disable mouse-centric menus.
(setq initial-scratch-message "")
(setq inhibit-startup-message t)
(setq inhibit-startup-echo-area-message "guerry")
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

;; Visual alarm bell instead of audio version
(setq visible-bell t)

;; Fringes (Frame padding?)
(set-fringe-mode 10)

;; Theme
(load-theme 'tango-dark)

;; Font(s)
(set-frame-font "Office Code Pro 12" nil t)

(global-visual-line-mode 1)
(global-display-line-numbers-mode t)
(column-number-mode 1)
(setq org-startup-indented t)

(setq backup-directory-alist
      `(("." . ,(expand-file-name "~/.emacs.d/backups"))))
(setq auto-save-file-name-transforms
      `((".*" "~/.emacs.d/.saves/" t)))
(message "Base loaded in...")

(require 'package)

(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(add-to-list 'package-archives '("elpa" . "https://elpa.gnu.org/packages/") t)

;; Update list of packages and allow download of them.
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

(use-package diminish)

(use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t)
  (setq auto-package-update-hide-results t)
  (auto-package-update-maybe))

(defvar common-files '() "List of common files for common-files command.")

(defun add-common-file (cfpath)
  (let ((name (substring cfpath (+ (string-match "/[-_.A-Za-z]+$" cfpath) 1) (string-match "\.[-_A-Za-z]+$" cfpath))))
    (add-to-list 'common-files `(,(format "[%s] %s" (upcase name) cfpath) . ,cfpath))))

(let ((common-files-to-add '("~/.emacs.d/org/roam/inbox.org"
                             "~/.emacs.d/org/roam/reflections.org"
                             "~/.emacs.d/org/roam/bibliography.org"
                             "~/.emacs.d/org/agenda/gtd.org"
                             "~/.emacs.d/org/roam/mistakes.org"
                             "~/.emacs.d/init.el"
                             "~/.emacs.d/org/roam/bookmarks.org"
                             "~/.emacs.d/org/roam/problems.org"
                             "~/.emacs.d/org/roam/work.org")))
  (mapcar 'add-common-file common-files-to-add))

(defun open-emacs-config-file ()
  (interactive)
  (find-file (expand-file-name "~/.emacs.d/init.org")))

(defun restart-emacs-debug-mode ()
  (interactive)
  (restart-emacs '("--debug-init")))

(defun restart-emacs-no-init ()
  (interactive)
  (restart-emacs '("--no-init-file")))

(defun create-scratch-buffer ()
  ;; from https://www.emacswiki.org/emacs/RecreateScratchBuffer
  (interactive)
  (switch-to-buffer-other-window (get-buffer-create "*scratch*"))
  (lisp-interaction-mode))

(defun load-config-file ()
  (interactive)
  (load-file (expand-file-name "~/.emacs.d/init.el")))

(defun my-org-id-get-create ()
  (format-time-string "%Y%m%d%k%M"))

(defun open-common-file ()
  (interactive)
  (ivy-read "Goto: " common-files :require-match t :action (lambda (file) (find-file (cdr file)))))

(defun gen-time-heading-id ()
  (format ":PROPERTIES:\n:ID: %s\n:END:" (my-org-id-get-create)))

(defun icallwp (func prefix)
  "Interactive call func with some prefix."
  (interactive)
  (let ((current-prefix-arg prefix))
    (call-interactively func)))

(defun copy-buffer-file-name ()
  (interactive)
  (kill-new buffer-file-name))

(message "Functions loaded in...")

(use-package general)

(use-package key-chord
  :diminish
  :config
  (key-chord-mode 1))

(use-package which-key
  :diminish
  :custom
  (which-key-side-window-location 'bottom)
  (which-key-side-window-max-height 0.30)
  (which-key-idle-delay 0.3)
  (which-key-idle-secondary-delay 0.05)
  :config
  (which-key-mode))

(general-define-key "<escape>" 'keyboard-escape-quit)

(general-create-definer my-leader-def
  :keymaps '(normal visual emacs)
  :prefix "SPC"
  :non-normal-prefix "M-SPC"
  :global-prefix "C-SPC")

(my-leader-def
  "o" '(:ignore t :which-key "Org-mode")
  "o l" '(org-add-note :which-key "Logbook entry")
  "o a" '(:ignore t :which-key "Archive")
  "o a e" '(org-archive-subtree-default :which-key "Entry")
  "o a s" '(org-archive-subtree :which-key "Subtree")
  "o a S" '((lambda () (interactive) (icallwp 'org-archive-subtree 4)) :which-key "Select")
  "o k" '(:ignore t :which-key "Clock")
  "o k i" '(org-clock-in :which-key "In")
  "o k o" '(org-clock-out :which-key "Out")
  "o k l" '(org-clock-in-last :which-key "Last")
  "o k d" '(org-clock-display :which-key "Display")
  "o k q" '(org-clock-cancel :which-key "Cancel")
  "o k g" '((lambda () (interactive) (icallwp 'org-clock-goto 4)) :which-key "Goto")
  "o k c" '(org-clock-goto :which-key "Current"))

(my-leader-def
 "r l" 'org-roam-buffer-toggle
 "r i" 'org-roam-node-insert
 "r f" 'org-roam-node-find
 "r" '(:ignore t :which-key "Org-roam")

 "r d j" '(org-roam-dailies-capture-today :which-key "Capture today")
 "r d p" '(org-roam-dailies-goto-today :which-key "Goto today")
 "r d b" '(org-roam-dailies-goto-next-note :which-key "Next note")
 "r d f" '(org-roam-dailies-goto-previous-note :which-key "Previous note")
 "r d" '(:ignore t :which-key "Dailies"))

(my-leader-def
