.emacs.d/init.org
*** Emacs
#+begin_src emacs-lisp
      (my-leader-def
        "e" '(:ignore t :which-key "Emacs")
        "e c" '(open-emacs-config-file :which-key "Open config file")
        "e r" '(restart-emacs :which-key "Regular restart")
        "e d" '(restart-emacs-debug-mode :which-key "Debug mode restart")
        "e n" '(restart-emacs-no-init :which-key "No init restart")
        "e s" '(create-scratch-buffer :which-key "Open scratch buffer")
        "e l" '(load-config-file :which-key "Load config file")
        "e m" '(view-echo-area-messages :which-key "Echo messages")
        "e q" '(save-buffers-kill-terminal :which-key "Quit")
        "e e" '(eval-buffer :which-key "Eval Buffer"))
#+end_src
*** Ivy and Counsel
#+begin_src emacs-lisp
  (my-leader-def
  ;; ivy
  "TAB" '(ivy-switch-buffer :which-key "Switch buffer")
  "b" '(counsel-bookmark :which-key "Bookmarks")
  "SPC" '(counsel-M-x :which-key "M-x")
  "s" '(swiper :which-key "Swiper"))
#+end_src
*** Files
#+begin_src emacs-lisp
    (my-leader-def
    "f" '(:ignore t :which-key "Files")
    "f f" '(find-file :which-key "Find File")
    "f c" '(open-common-file :which-key "Common Files"))
#+end_src
*** Deft
#+begin_src emacs-lisp
  (my-leader-def
  "d" '(deft :which-key "Deft"))
#+end_src
*** Help
#+begin_src emacs-lisp
    (my-leader-def
      "h" '(:ignore t :which-key "Help")
      "h f" '(helpful-callable :which-key "Function")
      "h v" '(helpful-variable :which-key "Variable")
      "h k" '(helpful-key :which-key "Key")
      "h d" '(helpful-at-point :which-key "At point")
      "h l" '(find-library :which-key "Library"))
#+end_src
*** Insert
#+begin_src emacs-lisp
  (my-leader-def
    "i" '(:ignore t :which-key "Insert")
    "i t" '(org-table-create-or-convert-from-region :which-key "Org table")
    "i d" '(org-deadline :which-key "Deadline")
    "i s" '(org-schedule :which-key "Schedule"))
#+end_src
*** Magit
#+begin_src emacs-lisp
    (my-leader-def
      "m" '(:ignore t :which-key "Magit")
      "m o" '(magit :which-key "Open"))
#+end_src
*** Misc
#+begin_src emacs-lisp
  (general-define-key "<escape>" 'keyboard-escape-quit)
#+end_src
* Org
** Config
#+begin_src emacs-lisp
            (setq org-todo-keywords '((sequence "TODO" "|" "DONE" "FAILED" "PARTIAL" "EXCUSE")))
            (setq org-todo-keyword-faces '(("TODO" . org-todo) ("DONE" . org-done) ("FAILED" . "red") ("PARTIAL" . "yellow") ("EXCUSE" . "gray")))
            (setq org-agenda-files `(,(expand-file-name "~/.emacs.d/org/agenda")))
            (setq org-startup-folded t)
            (setq org-return-follows-link t)
            (setq org-default-notes-file (expand-file-name "~/.emacs.d/org/notes.org"))
            (setq org-hide-emphasis-markers t)
            (setq org-hidden-keywords '(title))
            (setq org-adapt-indentation t)
            (setq org-deadline-warning-days 7)
            (setq org-tags-column -60)
            (setq org-capture-templates '(("a" "Agenda Items")
                                          ("ad" "Day plan" entry (file+headline "~/.emacs.d/org/agenda/gtd.org" "Day Plans") "**  %?")
                                          ("at" "Todo" checkitem (file+headline "~/.emacs.d/org/agenda/gtd.org" "Todos") "+ [ ] %^{TODO}." :immediate-finish t)
                                          ("i" "Inbox Note" entry (file "~/.emacs.d/org/roam/inbox.org")
                                           "* %<%Y-%m-%d %k:%M>\n%(gen-time-heading-id)\n**  %?")
                                          ("r" "Reflection templates")
                                          ("rg" "Reflection" entry (file+headline  "~/.emacs.d/org/roam/reflections.org" "Reflections") "**  %^{TITLE} \n%T\n %?")
                                          ("rt" "Question" checkitem (file+headline "~/.emacs.d/org/roam/reflections.org" "Questions") " + [ ] %^{Question}" :immediate-finish t)
                                          ("m" "Mistake Entry" entry (file "~/.emacs.d/org/roam/mistakes.org") "* %? \n%(gen-time-heading-id)")
                                          ("b" "Bibliography/Bookmarks")
                                          ("bm" "Bookmarks" entry (file+headline "~/.emacs.d/org/roam/bookmarks.org" "Website Bookmarks") "** %<%Y-%m-%d> [[%x][%?]] \n%(gen-time-heading-id)")
                                          ("p" "CP Problem" entry (file "~/.emacs.d/org/roam/problems.org") "* [[%x][%<%Y-%m-%d>]]" :immediate-finish t)
                                          ("c" "Chinese")
                                          ("cs" "Sentence" item (file+headline "~/.emacs.d/org/roam/20220831105406-mandarin.org" "Sentences") " + [%<%Y-%m-%d>] %^{SENTENCE} :: %^{MEANING}" :immediate-finish t)
                                          ("cv" "Vocabulary" item (file+headline "~/.emacs.d/org/roam/20220831105406-mandarin.org" "Vocab") " + [%<%Y-%m-%d>] %^{CHARACTER} (%^{PINYIN}) :: %^{MEANING}" :immediate-finish t)
                                          ("ca" "Archive" item (file+headline "~/.emacs.d/org/roam/20220831105406-mandarin.org" "Vocab") " + [%<%Y-%m-%d>]  %?")
                                          ("w" "Work Sessions")
                                          ("wp" "Plan" entry (file+headline "~/.emacs.d/org/roam/work.org" "Plans") "*  %?\n%(gen-time-heading-id)\n")
                                          ("ws" "Session" entry (file+headline "~/.emacs.d/org/roam/work.org" "Sessions") "** %<%Y-%m-%d %k:%M>\n%(gen-time-heading-id)\n*** Objectives\n**** TODO  %?\n*** Reflection\n")))
            (setq org-log-done 'time)
            (setq org-hide-block-startup t)
            (setq org-log-into-drawer t)
            (setq org-clock-persist 'history)
            (org-clock-persistence-insinuate)

            (general-define-key
             :keymaps 'org-agenda-mode-map
             "j" 'org-agenda-next-line
             "k" 'org-agenda-previous-line)
#+end_src
*** Latex Preview
#+begin_src emacs-lisp
  (setq org-format-latex-options '(:foreground default
                                               :background default
                                               :scale 1.30
                                               :html-foreground "Black"
                                               :html-background "Transparent"
                                               :html-scale 1.0
                                               :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
  (setq org-latex-create-formula-image-program 'dvipng)
  (setq org-latex-packages-alist '(("usenames" "color")
                                   ("" "amsmath")
                                   ("mathscr" "eucal")
                                   ("utf8" "inputenc")
                                   ("T1" "fontenc")
                                   ("" "graphicx")
                                   ("normalem" "ulem")
                                   ("" "textcomp")
                                   ("" "marvosym")
                                   ("" "latexsym")
                                   ("" "amssymb")))
#+end_src
** Babel
Taken from System Crafters "Emacs from Scratch #7." It automatically tangles init.org whenever it is saved.
#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/init.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src
** Tempo
Enables and sets auto-complete shorthands for source code blocks. Usage: <(abbreviation) then press <TAB>.
#+begin_src emacs-lisp
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("e" . "example"))
#+end_src

