.emacs.d/init.el
  "e" '(:ignore t :which-key "Emacs")
  "e c" '(open-emacs-config-file :which-key "Open config file")
  "e r" '(restart-emacs :which-key "Regular restart")
  "e d" '(restart-emacs-debug-mode :which-key "Debug mode restart")
  "e n" '(restart-emacs-no-init :which-key "No init restart")
  "e s" '(create-scratch-buffer :which-key "Open scratch buffer")
  "e l" '(load-config-file :which-key "Load config file")
  "e m" '(view-echo-area-messages :which-key "Echo messages")
  "e q" '(save-buffers-kill-terminal :which-key "Quit")
  "e e" '(eval-buffer :which-key "Eval Buffer"))

(my-leader-def
"TAB" '(ivy-switch-buffer :which-key "Switch buffer")
"SPC" '(counsel-M-x :which-key "M-x"))

(my-leader-def
"d" '(:ignore t :which-key "Dired")
"d f" '(find-file :which-key "Find File")
"d c" '(open-common-file :which-key "Common Files")
"d d" '(dired-do-rename :which-key "Dired"))

(my-leader-def
  "h" '(:ignore t :which-key "Help")
  "h f" '(helpful-callable :which-key "Function")
  "h v" '(helpful-variable :which-key "Variable")
  "h k" '(helpful-key :which-key "Key")
  "h d" '(helpful-at-point :which-key "At point")
  "h l" '(find-library :which-key "Library"))

(my-leader-def
  "i" '(:ignore t :which-key "Insert")
  "i t" '(org-table-create-or-convert-from-region :which-key "Org table")
  "i d" '(org-deadline :which-key "Deadline")
  "i s" '(org-schedule :which-key "Schedule"))

(general-create-definer apps-leader-def
    :keymaps '(normal visual emacs)
    :prefix "SPC a")

(apps-leader-def
"d" '(deft :which-key "Deft"))

(apps-leader-def 
  "s" '(swiper :which-key "Swiper"))

(apps-leader-def
 "a" '(org-agenda :which-key "Org Agenda"))

(apps-leader-def
 "c" '(org-capture :which-key "Capture"))

(apps-leader-def
  "m" '(magit :which-key "Magit"))

(apps-leader-def
  "b" '(counsel-bookmark :which-key "Bookmarks"))

(setq org-todo-keywords '((sequence "TODO" "|" "DONE" "FAILED" "PARTIAL" "EXCUSE")))
(setq org-todo-keyword-faces '(("TODO" . org-todo) ("DONE" . org-done) ("FAILED" . "red") ("PARTIAL" . "yellow") ("EXCUSE" . "gray")))
(setq org-agenda-files `(,(expand-file-name "~/.emacs.d/org/agenda")))
(setq org-startup-folded t)
(setq org-return-follows-link t)
(setq org-default-notes-file (expand-file-name "~/.emacs.d/org/notes.org"))
(setq org-hide-emphasis-markers t)
(setq org-hidden-keywords '(title))
(setq org-adapt-indentation t)
(setq org-deadline-warning-days 7)
(setq org-tags-column -60)
(setq org-log-done 'time)
(setq org-hide-block-startup t)
(setq org-log-into-drawer t)
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)

(general-define-key
 :keymaps 'org-agenda-mode-map
 "j" 'org-agenda-next-line
 "k" 'org-agenda-previous-line)

(setq org-format-latex-options '(:foreground default
                                             :background default
                                             :scale 1.30
                                             :html-foreground "Black"
                                             :html-background "Transparent"
                                             :html-scale 1.0
                                             :matchers ("begin" "$1" "$" "$$" "\\(" "\\[")))
(setq org-latex-create-formula-image-program 'dvipng)
(setq org-latex-packages-alist '(("usenames" "color")
                                 ("" "amsmath")
                                 ("mathscr" "eucal")
                                 ("utf8" "inputenc")
                                 ("T1" "fontenc")
                                 ("" "graphicx")
                                 ("normalem" "ulem")
                                 ("" "textcomp")
                                 ("" "marvosym")
                                 ("" "latexsym")
                                 ("" "amssymb")))

(setq org-capture-templates '(("a" "Agenda Items")
                              ("ad" "Day plan" entry (file+headline "~/.emacs.d/org/agenda/gtd.org" "Day Plans") "**  %?")
                              ("at" "Todo" checkitem (file+headline "~/.emacs.d/org/agenda/gtd.org" "Todos") "+ [ ] %^{TODO}." :immediate-finish t)
                              ("i" "Inbox Note" entry (file "~/.emacs.d/org/roam/inbox.org")
                               "* [%<%Y-%m-%d %k:%M>]  %?\n%(gen-time-heading-id)\n")
                              ("r" "Reflection templates")
                              ("rg" "Reflection" entry (file+headline  "~/.emacs.d/org/roam/reflections.org" "Reflections") "**  %^{TITLE} \n%T\n %?")
                              ("rt" "Question" checkitem (file+headline "~/.emacs.d/org/roam/reflections.org" "Questions") " + [ ] %^{Question}" :immediate-finish t)
                              ("m" "Mistake Entry" entry (file "~/.emacs.d/org/roam/mistakes.org") "* %? \n%(gen-time-heading-id)")
                              ("b" "Bibliography/Bookmarks")
                              ("bm" "Bookmarks" entry (file+headline "~/.emacs.d/org/roam/bookmarks.org" "Website Bookmarks") "** %<%Y-%m-%d> [[%x][%?]] \n%(gen-time-heading-id)")
                              ("p" "CP Problem" entry (file "~/.emacs.d/org/roam/problems.org") "* [[%x][%<%Y-%m-%d>]]" :immediate-finish t)
                              ("c" "Chinese")
                              ("cs" "Sentence" item (file+headline "~/.emacs.d/org/roam/20220831105406-mandarin.org" "Sentences") " + [%<%Y-%m-%d>] %^{SENTENCE} :: %^{MEANING}" :immediate-finish t)
                              ("cv" "Vocabulary" item (file+headline "~/.emacs.d/org/roam/20220831105406-mandarin.org" "Vocab") " + [%<%Y-%m-%d>] %^{CHARACTER} (%^{PINYIN}) :: %^{MEANING}" :immediate-finish t)
                              ("ca" "Archive" item (file+headline "~/.emacs.d/org/roam/20220831105406-mandarin.org" "Vocab") " + [%<%Y-%m-%d>]  %?")
                              ("w" "Work Sessions")
                              ("wp" "Plan" entry (file+headline "~/.emacs.d/org/roam/work.org" "Plans") "*  %?\n%(gen-time-heading-id)\n")
                              ("ws" "Session" entry (file+headline "~/.emacs.d/org/roam/work.org" "Sessions") "** %<%Y-%m-%d %k:%M>\n%(gen-time-heading-id)\n*** Objectives\n**** TODO  %?\n*** Reflection\n")))

;; Automatically tangle our Emacs.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/init.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("e" . "example"))
