.emacs.d/init.el

(use-package org-roam
  :init
  (add-to-list 'display-buffer-alist
               '("\\*org-roam\\*"
                 (display-buffer-in-direction)
                 (direction . right)
                 (window-width . 0.33)
                 (window-height . fit-window-to-buffer)))
  :custom
  (org-roam-directory (expand-file-name "~/.emacs.d/org/roam"))
  (org-roam-completion-everywhere t)
  (org-roam-v2-ack t)
  (org-roam-capture-templates '(("d" "default" plain "%?"
                                 :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n")
                                 :unnarrowed t)))
  (org-roam-dailies-capture-templates '(("d" "default" entry "* %?"
                                         :target (file+head "%<%Y-%m-%d>.org" "#+TITLE: %<%Y-%m-%d>\n")
                                         :unnarrowed t)
                                        ("m" "moment" entry "* %<%I:%M %p> %?"
                                         :target (file+head "%<%Y-%m-%d>.org" "#+TITLE: %<%Y-%m-%d>\n")
                                         :unnarrowed t)))
  :general
  (:keymaps 'org-mode-map
            "C-M-i" 'completion-at-point)
  :config
  (require 'org-roam-dailies)
  (org-roam-db-autosync-mode))

(defun my-org-appear-trigger-function ()
  (interactive)
  ;; (message "my org-appear-trigger function triggered!")
  (org-appear-mode)
  (add-hook 'evil-insert-state-entry-hook #'org-appear-manual-start)
  (add-hook 'evil-insert-state-exit-hook #'org-appear-manual-stop))

(use-package org-appear
  :after org
  :custom
  (org-appear-trigger 'manual))
  ;; :hook
  ;; (org-mode . my-org-appear-trigger-function))

(use-package org-superstar
  :custom
  (org-hide-leading-stars nil)
  (org-superstar-leading-bullet ?\s)
  (org-indent-mode-turns-on-hiding-stars nil)
  (org-superstar-remove-leading-stars t)
  (org-cycle-level-faces nil)
  (org-n-level-faces 4)
  :config
  (set-face-attribute 'org-level-8 nil :weight 'bold :inherit 'default)
  ;; Low levels are unimportant => no scaling
  (set-face-attribute 'org-level-7 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-6 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-5 nil :inherit 'org-level-8)
  (set-face-attribute 'org-level-4 nil :inherit 'org-level-8)
  ;; Top ones get scaled the same as in LaTeX (\large, \Large, \LARGE)
  (set-face-attribute 'org-level-3 nil :inherit 'org-level-8 :height 1.2) 
  (set-face-attribute 'org-level-2 nil :inherit 'org-level-8 :height 1.4) 
  (set-face-attribute 'org-level-1 nil :inherit 'org-level-8 :height 1.6) 
  (set-face-attribute 'org-document-title nil
                      :height 2.074
                      :foreground 'unspecified
                      :inherit 'org-level-8)
  :hook (org-mode . (lambda () (interactive)(org-superstar-mode 1))))

(message "Org loaded in...")

(use-package evil
  :demand t
  :diminish
  :general
  (:states 'insert
           (general-chord "fd") 'evil-normal-state
           (general-chord "df") 'evil-normal-state)
  (:states 'normal
           "j" 'evil-next-visual-line
           "k" 'evil-previous-visual-line)
  (:states 'normal
   :keymaps 'Info-mode-map
   "j" 'Info-scroll-up ;; <BACKSPACE>
   "k" 'Info-scroll-down ;; <SPC>
   "h" 'Info-backward-node ;; [
   "l" 'Info-forward-node ;; ]
   "e" 'Info-history-back ;; l
   "r" 'Info-history-forward ;;  r
   "m" 'Info-menu ;; m
   "n" 'Info-goto-node ;; g
   "t" 'Info-top-node ;; t
   "f" 'Info-follow-reference ;; f
   )
  (:states 'normal
   :keymaps 'elfeed-search-mode-map
   "r" 'elfeed-search-untag-all-unread
   "u" 'elfeed-search-tag-all-unread)
  :custom
  (evil-want-C-i-jump nil)
  (evil-respect-visual-line-mode t)
  :config
  (evil-mode 1))

(use-package evil-collection
  :after evil
  :custom
  (evil-collection-calendar-want-org-bindings t)
  :config
  (evil-collection-init)
  (evil-collection-calendar-setup))

(message "Evil loaded in...")

(use-package ivy
  :diminish
  :bind (:map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (:map ivy-minibuffer-map
              ("C-j" . ivy-next-line)
              ("C-k" . ivy-previous-line)))

(message "Ivy and Counsel loaded in...")

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package helpful)

(use-package flycheck)
;;  :init (global-flycheck-mode))

(use-package company)
;;:hook (prog-mode . global-company-mode))

(use-package restart-emacs)

(use-package magit)

(use-package elfeed
  :diminish)

(use-package elfeed-org
  :custom (rmh-elfeed-org-files (list (expand-file-name "~/.emacs.d/elfeed.org")))
  :config
  (elfeed-org))

(use-package deft
  :custom
  (deft-directory (expand-file-name "~/.emacs.d/org/"))
  (deft-recursive t ))

(use-package ox-hugo
  :pin melpa
  :after ox)
